** One Function, different parameters
Either one or two arguments
#+begin_src clojure
(defn greet
  ([to-whom] (println "Welcome to Blotts Books" to-whom))
  ([message to-whom] (println message to-whom)))
;; => #'user/greet
#+end_src

#+begin_src clojure :results output
(greet "Dolly")
(greet "Howdy" "Stranger")
#+end_src

#+RESULTS:
| Welcome to Blotts Books Dolly |
| Howdy Stranger                |

This is called as multi-arity function

How to avoid duplication
#+begin_src clojure
(defn greet
  ([to-whom] (greet "Welcome to Blotts Books" to-whom))
  ([message to-whom] (println message to-whom)))
;; => #'user/greet
#+end_src

#+begin_src clojure :results output
(greet "Dolly")
(greet "Howdy" "Stranger")
#+end_src

#+RESULTS:
| Welcome to Blotts Books Dolly |
| Howdy Stranger                |
** Docstrings
Note that *the arguments list is written after the docstring*
#+begin_src clojure
(defn average
  "Return the average of a and b"
  [a b]
  (/ (+ a b) 2.0))
;; => #'user/average
#+end_src
This ordering makes sense:-
After all, if the docstring were written after the arguments list, it would be treated as an expression inside the function body.

#+begin_src clojure :results output
(doc average)
#+end_src

#+RESULTS:
: -------------------------
: user/average
: ([a b])
:   Return the average of a and b

#+begin_src clojure
(def pi "The math constant Pi" 3.14)
;; => #'user/pi
#+end_src

#+begin_src clojure :results output
(doc pi)
#+end_src

#+RESULTS:
: -------------------------
: user/pi
:   The math constant Pi
** Namespaces, Symbols and Keywords
Q: Are namespaces first class citizens in Clojure? Yes!
Namespaces are just ordinary Clojure values
Eg:-
The current namespace is bound to the symbol ~*ns*~  (Recall that earmuffs represent dynamic vars)
#+begin_src clojure :results output
(println "Current ns:" *ns*)
#+end_src

#+RESULTS:
: Current ns: #namespace[user]

Look up a namespace. Useful to check the existence of some namespace.
#+begin_src clojure
(find-ns 'user)
;; => #namespace[user]
(find-ns 'doesnt-exist)
;; => nil
#+end_src

Map  the things defined in some namespace
#+begin_src clojure
(ns-map 'user)
;; => {primitives-classnames #'clojure.core/primitives-classnames,
;;     +' #'clojure.core/+',
;;     Enum java.lang.Enum,
;;     decimal? #'clojure.core/decimal?,
;;     restart-agent #'clojure.core/restart-agent,
;;     sort-by #'clojure.core/sort-by,
;;     ...,
;;     refer-clojure #'clojure.core/refer-clojure}

(ns-map 'doesnt-exist)
;; => Execution error at user/eval10058 (REPL:118).
;;    No namespace: doesnt-exist found

(namespace 'some-namespace/some-symbol)
;; => "some-namespace"
#+end_src
^(cant be used to check the existence of some namespace without writing code to catch exceptions etc... so prefer ~find-ns~ for such check)

Keywords can be namespaced too, but are seldom done.

** ~explain~-ing why a particular spec didnt match
Output happens by a printout
#+begin_src clojure :results output
(s/explain n-gt-10 1)
;; => nil
#+end_src

#+RESULTS:
: 1 - failed: (> % 10)

#+begin_src clojure :results output
(s/valid? ::book {:author :austen :title :emma})
;; => false
(s/explain ::book {:author :austen :title :emma})
;; => nil
#+end_src

#+RESULTS:
: :austen - failed: string? in: [:author] at: [:author] spec: :inventory.core/author
: :emma - failed: string? in: [:title] at: [:title] spec: :inventory.core/title
: {:author :austen, :title :emma} - failed: (contains? % :copies) spec: :inventory.core/book

---------------------------------------------------------------------------------------------------
~conform~ is a nice truthy function:-
If a spec fails, it returns the specific keyword =:clojure.spec.alpha/invalid=
#+begin_src clojure
(s/conform n-gt-10 1)
;; => :clojure.spec.alpha/invalid
#+end_src

If it matches, it returns the value itself for simple specs &
for specs with /descriptive keywords/
returns a map of 'spec descriptive' keywords to collection values.
#+begin_src clojure
(s/conform number? 1968)
;; => 1968
(s/conform s-n-s-n ["Emma" 1815 "Jaws" 1974])
;; => {:s1 "Emma", :n1 1815, :s2 "Jaws", :n2 1974}
#+end_src
** And Back to Clojure
Using Java from Clojure, an example: =java.io.File=

While calling the Java constructor, notice the *dot* at the end of the classname
#+begin_src clojure :results output
(def authors (java.io.File. "authors.txt"))
;; => #'user/authors

(if (.exists authors)
  (println "Our authors file is there")
  (println "Our authors file is missing"))

(if (.canRead authors)
  (println "We can read it"))
#+end_src

#+RESULTS:
| Our authors file is there |
| We can read it            |

change permissions
#+begin_src clojure
(.setReadable authors true)
;; => true
#+end_src
^Notice that we call a method with the object/instance as the first argument,
and method parameters as arguments 2,3,4...etc.

The method name is prefixed with a *dot*

---------------------------------------------------------------------------------------------------
Accessing java object's public fields, =(.-<field> <instance>)=
Eg
#+begin_src clojure
(def rect (java.awt.Rectangle. 0 0 10 20))
;; => #'user/rect

(.-width rect)
;; => 10
(.-height rect)
;; => 20
#+end_src

** Great Power
BTW, every Clojure program runs on some java thread, called the single main thread.

~java.lang.Thread~ , its ~.start~ method:-
#+begin_src clojure :results output
(defn do-something-in-a-thread []
  (println  "Hello from the thread")
  (Thread/sleep 3000)
  (println "Good bye from the thread"))
;; => #'user/do-something-in-a-thread

(def the-thread (Thread. do-something-in-a-thread))
;; => #'user/the-thread

(.start the-thread)
(println "The main thread")
#+end_src

#+RESULTS:
| Hello from the thread |
| The main thread       |

^Org babel doesnt handle the last print gracefully.
Run it in a repl, and you will see a delayed goodbye printout after the above two printouts.

~Thread.~ constructor accepts any object that implements the ~Runnable~ interface.
Conveniently, all Clojure functions implement the ~Runnable~ interface.
ie ~do-something-in-a-thread~ is a valid argument to ~Thread.~

The call to ~.start~ will run a thread separate from the main thread.

** Good fences make happy threads
#+begin_src clojure
(def inventory [{:title "Emma" :sold 51 :revenue 255}
                {:title "2001" :sold 17 :revenue 170}])
;; => #'user/inventory
#+end_src

Lets say we wanted to run some computations of total sales and total revenue,
in parallel threads
#+begin_src clojure
(.start (Thread. (sum-copies-sold inventory))) ;I suspect a syntax error in this and next line
(.start (Thread. (sum-revenue inventory)))     ;in the argument to Thread.
#+end_src
Since we know that ~inventory~ is immutable,
it gives us a lot of confidence to pass it around to different threads without any worry.

Aside:- Notice that ~Thread.~ accepts a function name if it has no arguments, and,
       a bracketed function call along with arguments if there are.
Doubt:-
[[xournalpp:Thread constructor argument doubt.xopp]]
Therefore, the proper syntax should have been
#+begin_src clojure
(.start (Thread. #(sum-copies-sold inventory))) ;notice the hash
(.start (Thread. #(sum-revenue inventory)))     
#+end_src

---------------------------------------------------------------------------------------------------
Recall the dynamic vars that we learn in Chapter 8,
Since their value changes only inside a ~binding~,
they play well with threads.
Eg:-
#+begin_src clojure :results output
(def ^:dynamic *favorite-book* "Oliver Twist")
;; => #'user/*favorite-book*
(def thread-1 (Thread. #(binding [*favorite-book* "2001"]
                          (println "My favorite book is" *favorite-book*))))
;; => #'user/thread-1

(def thread-2 (Thread. #(binding [*favorite-book* "Emma"]
                          (println "My favorite book is" *favorite-book*))))
;; => #'user/thread-2

(.start thread-1)
(.start thread-2)
#+end_src

#+RESULTS:
| My favorite book is 2001 |
| My favorite book is Emma |

At the start of both the threads, "Oliver Twist" remains the initial value of the dynamic var.
ie, one of the threads doesnt conflict with the other.
---------------------------------------------------------------------------------------------------
Therefore,
the immtuability and per-thread dynamic variable binding helps us avoid race conditions.

*** When are macro arguments evaluated
#+begin_src clojure :results output
(defmacro print-it [something]
  (list 'println "Something is" something))
;; => #'user/print-it
(print-it (+ 10 20))
#+end_src

#+RESULTS:
: Something is 30

Refer to above diagram:-
The arithmetic expression ~(+ 10 20)~ *did not* get evaluated during read step.
It *did not* get evaluated during macro-expansion step.
It *did* get evaluated during runtime. Specifically, during ~list~ function's runtime.

*** A nice example that illustrates what happens when in a macro
#+begin_src clojure :results output
(defmacro illustrate-timing []
  (println "This happens at A? time")
  `(println "This happens at B? time"))
;; => #'user/illustrate-timing

(def foo-uses-that-macro #(illustrate-timing))
;; => #'user/foo-uses-that-macro
#+end_src

#+RESULTS:
: This happens at A? time
#+begin_src clojure :results output
(foo-uses-that-macro)
#+end_src

#+RESULTS:
: This happens at B? time

A=macro-expansion time
B=runtime

*ie Macros make themselve felt at two distinct times*:
directly at macro-expansion time,
indirectly at runtime.

